FrankBau/ST_Drone_FCU_F401/STM32 FW Project/Official release with BLE Remocon - 170318/Src/sensor_service.c
  ret = aci_gatt_update_char_value(HWServW2STHandle, EnvironmentalCharHandle, 0, 2+4+2+2+2,buff);

  if (ret != BLE_STATUS_SUCCESS){
    if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_ERR)){
      BytesToWrite =sprintf((char *)BufferToWrite, "Error Updating Environmental Char\r\n");
      Stderr_Update(BufferToWrite,BytesToWrite);
    } else {
      PRINTF("Error Updating Environmental Char\r\n");
    }
    return BLE_STATUS_ERROR;
  }
  return BLE_STATUS_SUCCESS;
}



/**
 * @brief  Update ARMING characteristic value
 * @param  uint8_t ArmingStatus Arming status 0/1 (off/on)
 * @retval tBleStatus   Status
 */
tBleStatus ARMING_Update(uint8_t ArmingStatus)
{
  tBleStatus ret;

  uint8_t buff[2+1];

  STORE_LE_16(buff  ,(HAL_GetTick()>>3));
  buff[2] = ArmingStatus;

  ret = aci_gatt_update_char_value(HWServW2STHandle, ArmingCharHandle, 0, 2+1,buff);

  if (ret != BLE_STATUS_SUCCESS){
    if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_ERR)){
      BytesToWrite = sprintf((char *)BufferToWrite, "Error Updating ARMING Char\r\n");
      Stderr_Update(BufferToWrite,BytesToWrite);
    } else {
      PRINTF("Error Updating Temp Char\r\n");
    }
    return BLE_STATUS_ERROR;
  }
  return BLE_STATUS_SUCCESS;
}


/**
 * @brief  Puts the device in connectable mode.
 * @param  None 
 * @retval None
 */
void setConnectable(void)
{  
	// see https://github.com/STMicroelectronics/BlueSTSDK_Android#advertise
	char local_name[8] = {AD_TYPE_COMPLETE_LOCAL_NAME,NAME_DRN};
	uint8_t manuf_data[26] = {

	2,
	0x0A, // field type: Transmission Power
	0x00, /* 0 dBm */

	8,
	0x09,
	NAME_DRN, // Complete Name

    13, 	// field length
	0xFF, 	// field type
	0x01, 	// BlueST SDK version
    0x80,	// device ID (type)
    0x00, 	// feature mask
    0xE0, 	// feature mask: ACC+Gyro+Mag
    0x00, 	//
    0x00, 	//
    0x00, 	/* BLE MAC start */
    0x00,
    0x00,
    0x00,
    0x00,
    0x00, 	/* BLE MAC stop */
  };

  /* BLE MAC */
  manuf_data[20] = bdaddr[5];
  manuf_data[21] = bdaddr[4];
  manuf_data[22] = bdaddr[3];
  manuf_data[23] = bdaddr[2];
  manuf_data[24] = bdaddr[1];
  manuf_data[25] = bdaddr[0];

  manuf_data[16] |= 0x20; /* Led */
  manuf_data[17] |= 0x05; /* Temperature and RSSI values*/
  manuf_data[17] |= 0x08; /* Battery level (percentage of full battery) */
  manuf_data[17] |= 0x10; /* Pressure value*/
    
  /* Max Char */
  manuf_data[18] |=0x80;

  /* disable scan response */
  hci_le_set_scan_resp_data(0,NULL);
  aci_gap_set_discoverable(ADV_IND, 0, 0,
#ifndef MAC_MOTENV
  #ifdef MAC_STM32UID_MOTENV
                           STATIC_RANDOM_ADDR,
  #else /* MAC_STM32UID_MOTENV */
                           RANDOM_ADDR,
  #endif /* MAC_STM32UID_MOTENV */
#else /* MAC_BLUEMS */  
                           PUBLIC_ADDR,  
#endif /* MAC_MOTENV */
                           NO_WHITE_LIST_USE,
                           sizeof(local_name), local_name, 0, NULL, 0, 0);

  /* Send Advertising data */
  aci_gap_update_adv_data(26, manuf_data);
}

/**
 * @brief  This function is called when there is a LE Connection Complete event.
 * @param  uint8_t addr[6] Address of peer device
 * @param  uint16_t handle Connection handle
 * @retval None
 */
static void GAP_ConnectionComplete_CB(uint8_t addr[6], uint16_t handle)
{  
  connected = TRUE;
  connection_handle = handle;

#ifdef MOTENV_DEBUG_CONNECTION
  PRINTF(">>>>>>CONNECTED %x:%x:%x:%x:%x:%x\r\n",addr[5],addr[4],addr[3],addr[2],addr[1],addr[0]);
#endif /* MOTENV_DEBUG_CONNECTION */

  ConnectionBleStatus=0;
  
  if(TargetBoardFeatures.HWAdvanceFeatures) {
    DisableHWFeatures();
  }
  
aci_l2cap_connection_parameter_update_request(connection_handle,
                                                      10 /* interval_min*/,
                                                      10 /* interval_max */,
                                                      0   /* slave_latency */,
                                                      400 /*timeout_multiplier*/);
}

/**
 * @brief  This function is called when the peer device get disconnected.
 * @param  None 
 * @retval None
 */
static void GAP_DisconnectionComplete_CB(void)
{
  connected = FALSE;

#ifdef MOTENV_DEBUG_CONNECTION  
  PRINTF("<<<<<<DISCONNECTED\r\n");
#endif /* MOTENV_DEBUG_CONNECTION */  

  /* Make the device connectable again. */
  set_connectable = TRUE;

  ConnectionBleStatus=0;
  
  if(TargetBoardFeatures.HWAdvanceFeatures) {
    DisableHWFeatures();
  }
  
}

/**
 * @brief  This function is called when there is a Bluetooth Read request
 * @param  uint16_t handle Handle of the attribute
 * @retval None
 */
void Read_Request_CB(uint16_t handle)
{
	PRINTF("Read_Request_CB(0x%02x\n", handle );

  uint8_t Status;  
  if(handle == EnvironmentalCharHandle + 1){
    /* Read Request for Pressure,Battery, and Temperatures*/
    float SensorValue;
    int32_t PressToSend=0;
    uint16_t BattToSend=0;
    int16_t TempToSend=0,RSSIToSend=0;
    int32_t decPart, intPart;
    if(TargetBoardFeatures.HandlePressSensor) {
      if((TargetBoardFeatures.SnsAltFunc ? BSP_PRESSURE_IsInitialized : BSP_PRESSURE_IsInitialized)(TargetBoardFeatures.HandlePressSensor,&Status)==COMPONENT_OK) {
        (TargetBoardFeatures.SnsAltFunc ? BSP_PRESSURE_Get_Press : BSP_PRESSURE_Get_Press)(TargetBoardFeatures.HandlePressSensor,(float *)&SensorValue);
        MCR_BLUEMS_F2I_2D(SensorValue, intPart, decPart);
        PressToSend=intPart*100+decPart;
      }
    }

    Batt_Env_RSSI_Update(PressToSend,BattToSend,TempToSend,RSSIToSend);
  } else if(handle == ArmingCharHandle + 1){
    /* Read Request for Arming Status */
    ARMING_Update(TargetBoardFeatures.LedStatus);
  } else if(handle == AccEventCharHandle +1) {
    
  }else if (handle == StdErrCharHandle + 1) {
    /* Send again the last packet for StdError */
    Stderr_Update_AfterRead();
  } else if (handle == TermCharHandle + 1) {
    /* Send again the last packet for Terminal */
    Term_Update_AfterRead();
#ifdef STM32_SENSORTILE
  }else if(handle == GGCharHandle + 1){
    GG_Update();
#endif /* STM32_SENSORTILE */
  }

  //EXIT:
  if(connection_handle != 0)
    aci_gatt_allow_read(connection_handle);
}

/**
 * @brief  This function is called when there is a change on the gatt attribute
 * With this function it's possible to understand if one application 
 * is subscribed or not to the one service
 * @param uint16_t att_handle Handle of the attribute
 * @param uint8_t *att_data attribute data
 * @param uint8_t data_length length of the data
 * @retval None
 */
void Attribute_Modified_CB(uint16_t attr_handle, uint8_t * att_data, uint8_t data_length) 
{
	PRINTF("Attribute_Modified_CB(0x%02x\n", attr_handle );

  if(attr_handle == ConfigCharHandle + 2) 
  {
    ;/* do nothing... only for removing the message "Notification UNKNOW handle" */
  } 
  else if(attr_handle == StdErrCharHandle + 2)
  {
    if (att_data[0] == 01) 
    {
      W2ST_ON_CONNECTION(W2ST_CONNECT_STD_ERR);
    } else if (att_data[0] == 0)
    {
      W2ST_OFF_CONNECTION(W2ST_CONNECT_STD_ERR);
    }
  } 
  else if(attr_handle == TermCharHandle + 2)
  {
    if (att_data[0] == 01) 
    {
      W2ST_ON_CONNECTION(W2ST_CONNECT_STD_TERM);
    } 
    else if (att_data[0] == 0)
    {
      W2ST_OFF_CONNECTION(W2ST_CONNECT_STD_TERM);
    }
  } 
  else if (attr_handle == TermCharHandle + 1)
  {
    uint32_t SendBackData =1; /* By default Answer with the same message received */

    {
      /* Received one write from Client on Terminal characteristc */
      SendBackData = DebugConsoleCommandParsing(att_data,data_length);
    }

    /* Send it back for testing */
    if(SendBackData) 
    {
      Term_Update(att_data,data_length);
    }
  }
  else if(attr_handle == ArmingCharHandle + 2)
  {
    if (att_data[0] == 01) 
    {
      W2ST_ON_CONNECTION(W2ST_CONNECT_LED);
      /* Update the LED feature */
      ARMING_Update(TargetBoardFeatures.LedStatus);
    } 
    else if (att_data[0] == 0)
    {
      W2ST_OFF_CONNECTION(W2ST_CONNECT_LED);
    }
#ifdef MOTENV_DEBUG_CONNECTION
    if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_TERM)) 
    {
      BytesToWrite =sprintf((char *)BufferToWrite,"--->Led=%s\r\n", W2ST_CHECK_CONNECTION(W2ST_CONNECT_LED) ? "ON" : "OFF");
     Term_Update(BufferToWrite,BytesToWrite);
    } 
    else
      PRINTF("--->Led=%s\r\n", W2ST_CHECK_CONNECTION(W2ST_CONNECT_LED) ? "ON" : "OFF");
#endif /* MOTENV_DEBUG_CONNECTION */
  } 
  else if (attr_handle == ConfigCharHandle + 1) 
  {
    /* Received one write command from Client on Configuration characteristc */
    ConfigCommandParsing(att_data, data_length);		
  }  
  else if (attr_handle == MaxCharHandle+ 1)
  {
     
     joydata[0] = att_data[1];
     joydata[1] = att_data[2];
     joydata[2] = att_data[3];
     joydata[3] = att_data[4];
     joydata[4] = att_data[5];
     joydata[5] = att_data[6];
     joydata[6] = att_data[7];
     joydata[7] = att_data[8];

